{
  "vendor": "Microsoft",
  "product": "Azure AD Identity Protection",
  "severity": "Critical",
  "category": "Identity",
  "alert_name": "Password Change from Anonymous TOR Network",
  "alert_id": "AZUREAD-CRED-SH-002",
  "description": "A critical security event was detected on the Azure AD account for aisherlock@bakerstreetlabs.io. The user's password was successfully changed from an IP address (185.220.101.47) identified as a TOR exit node located in the Netherlands. This password change occurred approximately 24 hours after the user clicked a phishing link (see related alert PROOFPOINT-PHISH-SH-001), strongly suggesting account compromise and credential harvesting. The TOR network is commonly used by threat actors to anonymize their identity and location during malicious activities. The password change was initiated through the Azure AD self-service password reset portal, which did not require multi-factor authentication due to a legacy policy exception for the Security Research department. Azure AD Identity Protection flagged this activity as high-risk due to the combination of: 1) Authentication from an anonymizing proxy, 2) Unusual sign-in location (Netherlands vs. typical US-based activity), 3) Password change immediately following successful authentication, and 4) Temporal correlation with recent phishing activity. No account recovery challenges were completed, suggesting the threat actor possessed valid credentials obtained from the phishing campaign. The account remains active and has been used for subsequent authentication attempts from the same TOR infrastructure. Immediate password reset, MFA enforcement, and session revocation are urgently recommended. This represents confirmed account takeover requiring immediate incident response.",
  "relative_timestamp_hours": 144.0,
  "campaign_name": "SH-UserInvestigation-Nov2025",
  "user_name": [
    "aisherlock@bakerstreetlabs.io"
  ],
  "domain": "bakerstreetlabs.io",
  "email": "aisherlock@bakerstreetlabs.io",
  "department": "Security Research",
  "cloud_provider": [
    "Azure"
  ],
  "cloud_service_name": "Azure Active Directory",
  "cloud_operation_type": [
    "Password Change"
  ],
  "cloud_identity_type": [
    "User Account"
  ],
  "remote_ip": [
    3113533743
  ],
  "asn": "AS51167",
  "asn_name": "Contabo GmbH",
  "threat_name": "Account Takeover via TOR Network",
  "attack_mode": "Credential Access",
  "risk_score": "95",
  "risk_rating": "Critical",
  "verdict": "Malicious",
  "log_source": "Azure AD Audit Logs",
  "mitre_att&ck_tactic": "TA0006 - Credential Access",
  "mitre_att&ck_technique": "T1110 - Brute Force",
  "recommended_actions": "1. Immediately force password reset for aisherlock@bakerstreetlabs.io. 2. Revoke all active sessions and refresh tokens. 3. Enable mandatory MFA for the account. 4. Review all account activities since initial phishing event (168h ago). 5. Check for unauthorized access to cloud resources (OneDrive, SharePoint, email). 6. Block authentication from TOR exit nodes at conditional access policy level. 7. Investigate any data access or exfiltration during compromised period. 8. Notify user and conduct security interview.",
  "external_link": "https://portal.azure.com/#view/Microsoft_AAD_IAM/IdentityProtectionMenuBlade",
  "related_campaign": "PROOFPOINT-PHISH-SH-001"
}